In [1]:
from hossam import load_data
import numpy as np

In [2]:
origin = load_data("grade")
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [3]:
df1 = origin.copy()
df1['직접합계'] = df1['국어'] + df1['영어'] + df1['수학'] + df1['과학']
df1

    학년  성별  국어   영어  수학  과학  직접합계
이름
철수   1  남자  98   77  88  64   327
영희   2  여자  88  120  62  72   342
민철   1  남자  92   70  83  79   324
수현   3  여자  63   60  31  71   225
호영   4  남자  75   50  90  88   303
영호   4  남자  80   88  91  72   331
용식   2  남자  82   88  79  90   339
나영   1  여자  90   92  81  95   358
석영   1  남자  91   90  89  80   350

In [4]:
df2 = origin.copy()
df2['합계'] = df2[df2.columns[2:6]].sum(axis=1)
df2

    학년  성별  국어   영어  수학  과학   합계
이름
철수   1  남자  98   77  88  64  327
영희   2  여자  88  120  62  72  342
민철   1  남자  92   70  83  79  324
수현   3  여자  63   60  31  71  225
호영   4  남자  75   50  90  88  303
영호   4  남자  80   88  91  72  331
용식   2  남자  82   88  79  90  339
나영   1  여자  90   92  81  95  358
석영   1  남자  91   90  89  80  350

In [5]:
df3 = origin.copy()
df3['합계']=df3.iloc[:, 2:].sum(axis=1)
df3

    학년  성별  국어   영어  수학  과학   합계
이름
철수   1  남자  98   77  88  64  327
영희   2  여자  88  120  62  72  342
민철   1  남자  92   70  83  79  324
수현   3  여자  63   60  31  71  225
호영   4  남자  75   50  90  88  303
영호   4  남자  80   88  91  72  331
용식   2  남자  82   88  79  90  339
나영   1  여자  90   92  81  95  358
석영   1  남자  91   90  89  80  350

In [6]:
df3['평균'] = df3.iloc[:, 2:6].mean(axis=1)
df3['최대값'] = df3.iloc[:,2:6].max(axis=1)
df3['최소값'] = df3.iloc[:,2:6].min(axis=1)
df3['표준편차'] = df3.iloc[:,2:6].std(axis=1)
df3['분산'] = df3.iloc[:,2:6].var(axis=1)
df3

    학년  성별  국어   영어  수학  과학   합계     평균  최대값  최소값       표준편차          분산
이름
철수   1  남자  98   77  88  64  327  81.75   98   64  14.614491  213.583333
영희   2  여자  88  120  62  72  342  85.50  120   62  25.370587  643.666667
민철   1  남자  92   70  83  79  324  81.00   92   70   9.128709   83.333333
수현   3  여자  63   60  31  71  225  56.25   71   31  17.461863  304.916667
호영   4  남자  75   50  90  88  303  75.75   90   50  18.409689  338.916667
영호   4  남자  80   88  91  72  331  82.75   91   72   8.539126   72.916667
용식   2  남자  82   88  79  90  339  84.75   90   79   5.123475   26.250000
나영   1  여자  90   92  81  95  358  89.50   95   81   6.027714   36.333333
석영   1  남자  91   90  89  80  350  87.50   91   80   5.066228   25.666667

In [7]:
df4 = origin.copy()
df4['합계'] = df4.iloc[:, 2:6].sum(axis=1)
df4['평균'] = df4.iloc[:, 2:6].mean(axis=1)
df4

    학년  성별  국어   영어  수학  과학   합계     평균
이름
철수   1  남자  98   77  88  64  327  81.75
영희   2  여자  88  120  62  72  342  85.50
민철   1  남자  92   70  83  79  324  81.00
수현   3  여자  63   60  31  71  225  56.25
호영   4  남자  75   50  90  88  303  75.75
영호   4  남자  80   88  91  72  331  82.75
용식   2  남자  82   88  79  90  339  84.75
나영   1  여자  90   92  81  95  358  89.50
석영   1  남자  91   90  89  80  350  87.50

In [8]:
df4['결과1'] = np.where(df4['평균']>= 80, '합격', '불합격')
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1
이름
철수   1  남자  98   77  88  64  327  81.75   합격
영희   2  여자  88  120  62  72  342  85.50   합격
민철   1  남자  92   70  83  79  324  81.00   합격
수현   3  여자  63   60  31  71  225  56.25  불합격
호영   4  남자  75   50  90  88  303  75.75  불합격
영호   4  남자  80   88  91  72  331  82.75   합격
용식   2  남자  82   88  79  90  339  84.75   합격
나영   1  여자  90   92  81  95  358  89.50   합격
석영   1  남자  91   90  89  80  350  87.50   합격

In [9]:
df4['결과2'] = "불합격"
df4.loc[df4['평균']>=80, "결과2"] ='합격'
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격
영희   2  여자  88  120  62  72  342  85.50   합격   합격
민철   1  남자  92   70  83  79  324  81.00   합격   합격
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격
영호   4  남자  80   88  91  72  331  82.75   합격   합격
용식   2  남자  82   88  79  90  339  84.75   합격   합격
나영   1  여자  90   92  81  95  358  89.50   합격   합격
석영   1  남자  91   90  89  80  350  87.50   합격   합격

In [10]:
conditions = [ (df4['평균'] >=90),
                (df4['평균'] >=80),
                (df4['평균'] >=70)]

value = ['A', 'B', 'C']

df4['학점1'] = np.select(conditions, value, default = 'F')
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점1
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격   B
영희   2  여자  88  120  62  72  342  85.50   합격   합격   B
민철   1  남자  92   70  83  79  324  81.00   합격   합격   B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격   F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격   C
영호   4  남자  80   88  91  72  331  82.75   합격   합격   B
용식   2  남자  82   88  79  90  339  84.75   합격   합격   B
나영   1  여자  90   92  81  95  358  89.50   합격   합격   B
석영   1  남자  91   90  89  80  350  87.50   합격   합격   B

In [11]:
def getScore(x):
    if x>=90:
        score = 'A'
    elif x>=80:
        score = 'B'
    elif x>=70:
        score = 'C'
    else:
        score = 'F'

    return score

In [12]:
df4['학점2'] = df4['평균'].apply(getScore)
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점1 학점2
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격   B   B
영희   2  여자  88  120  62  72  342  85.50   합격   합격   B   B
민철   1  남자  92   70  83  79  324  81.00   합격   합격   B   B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격   F   F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격   C   C
영호   4  남자  80   88  91  72  331  82.75   합격   합격   B   B
용식   2  남자  82   88  79  90  339  84.75   합격   합격   B   B
나영   1  여자  90   92  81  95  358  89.50   합격   합격   B   B
석영   1  남자  91   90  89  80  350  87.50   합격   합격   B   B

In [13]:
df4['학점3'] = df4['평균'].apply(
    lambda x: {10: "A", 9: "A", 8: "B", 7: "C"}.get(x//10, "F"))
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점1 학점2 학점3
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격   B   B   B
영희   2  여자  88  120  62  72  342  85.50   합격   합격   B   B   B
민철   1  남자  92   70  83  79  324  81.00   합격   합격   B   B   B
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격   F   F   F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격   C   C   C
영호   4  남자  80   88  91  72  331  82.75   합격   합격   B   B   B
용식   2  남자  82   88  79  90  339  84.75   합격   합격   B   B   B
나영   1  여자  90   92  81  95  358  89.50   합격   합격   B   B   B
석영   1  남자  91   90  89  80  350  87.50   합격   합격   B   B   B

In [15]:
df4['성별코드'] = df4['성별'].map({"남자": "M", "여자": "F"})
df4

    학년  성별  국어   영어  수학  과학   합계     평균  결과1  결과2 학점1 학점2 학점3 성별코드
이름
철수   1  남자  98   77  88  64  327  81.75   합격   합격   B   B   B    M
영희   2  여자  88  120  62  72  342  85.50   합격   합격   B   B   B    F
민철   1  남자  92   70  83  79  324  81.00   합격   합격   B   B   B    M
수현   3  여자  63   60  31  71  225  56.25  불합격  불합격   F   F   F    F
호영   4  남자  75   50  90  88  303  75.75  불합격  불합격   C   C   C    M
영호   4  남자  80   88  91  72  331  82.75   합격   합격   B   B   B    M
용식   2  남자  82   88  79  90  339  84.75   합격   합격   B   B   B    M
나영   1  여자  90   92  81  95  358  89.50   합격   합격   B   B   B    F
석영   1  남자  91   90  89  80  350  87.50   합격   합격   B   B   B    M

In [23]:
origin = load_data("online_shop_sales")
origin

[data] https://data.hossam.kr/data/lab05/online_shop_sales.xlsx
[desc] 우수 고객을 찾아라! - 영업 데이터 분석 챌린지

field      description
---------  ----------------
OrderID    주문번호(인덱스)
UserID     고객아이디
Product    상품
Price      가격
Quantity   주문수량
OrderDate  주문일

         UserID          Product  Price  Quantity  OrderDate
OrderID
1          1001           Laptop   1200         1 2024-10-01
2          1002            Mouse     25         2 2024-10-01
3          1001         Keyboard     75         1 2024-10-02
4          1003          Monitor    300         1 2024-10-03
5          1002           Webcam     50         1 2024-10-04
6          1003       HDMI Cable     15         3 2024-10-05
7          1001          USB Hub     30         2 2024-10-06
8          1004           Laptop   1300         1 2024-10-07
9          1002            Mouse     25         1 2024-10-08
10         1003          Monitor    300         2 2024-10-09
11         1001     External SSD    150         1 2024-10-10
12         1004  Docking Station    250         1 2024-10-11
13         1002         Keyboard     80         1 2024-10-12
14         1003           Webcam     55         1 2024-10-13
15         1001            Mouse     28         1 2024-10-14

In [31]:
df1 = origin.copy()
#고객별 총 구매 금액
총구매금액 = df1['Price'] * df1['Quantity']
df1['총구매금액'] = 총구매금액
df1

         UserID          Product  Price  Quantity  OrderDate  총구매금액
OrderID
1          1001           Laptop   1200         1 2024-10-01   1200
2          1002            Mouse     25         2 2024-10-01     50
3          1001         Keyboard     75         1 2024-10-02     75
4          1003          Monitor    300         1 2024-10-03    300
5          1002           Webcam     50         1 2024-10-04     50
6          1003       HDMI Cable     15         3 2024-10-05     45
7          1001          USB Hub     30         2 2024-10-06     60
8          1004           Laptop   1300         1 2024-10-07   1300
9          1002            Mouse     25         1 2024-10-08     25
10         1003          Monitor    300         2 2024-10-09    600
11         1001     External SSD    150         1 2024-10-10    150
12         1004  Docking Station    250         1 2024-10-11    250
13         1002         Keyboard     80         1 2024-10-12     80
14         1003           Webcam     55         1 2024-10-13     55
15         1001            Mouse     28         1 2024-10-14     28

In [36]:
각고객별총구매금액 = df1.groupby('UserID')['총구매금액'].sum()
각고객별총구매금액

UserID
1001    1513
1002     205
1003    1000
1004    1550
Name: 총구매금액, dtype: int64

In [38]:
#총 구매 금액이 가장 높은 상위 2명의 고객을 찾아 UserID와 총 구매 금액을 출력
top2 = 각고객별총구매금액.sort_values(ascending=False).head(2)
top2

UserID
1004    1550
1001    1513
Name: 총구매금액, dtype: int64

In [42]:
#최종 결과 = 총 구매 금액을 기준으로 내림차순 정렬로 전제 데이터 제시
df1['각고객별총구매금액'] = df1['UserID'].map(각고객별총구매금액)
df_final = df1.sort_values(by='각고객별총구매금액', ascending=False)
df_final

         UserID          Product  Price  Quantity  OrderDate  총구매금액  각고객별총구매금액
OrderID
8          1004           Laptop   1300         1 2024-10-07   1300       1550
12         1004  Docking Station    250         1 2024-10-11    250       1550
1          1001           Laptop   1200         1 2024-10-01   1200       1513
11         1001     External SSD    150         1 2024-10-10    150       1513
15         1001            Mouse     28         1 2024-10-14     28       1513
3          1001         Keyboard     75         1 2024-10-02     75       1513
7          1001          USB Hub     30         2 2024-10-06     60       1513
14         1003           Webcam     55         1 2024-10-13     55       1000
10         1003          Monitor    300         2 2024-10-09    600       1000
4          1003          Monitor    300         1 2024-10-03    300       1000
6          1003       HDMI Cable     15         3 2024-10-05     45       1000
5          1002           Webcam     50         1 2024-10-04     50        205
2          1002            Mouse     25         2 2024-10-01     50        205
9          1002            Mouse     25         1 2024-10-08     25        205
13         1002         Keyboard     80         1 2024-10-12     80        205